# Projeto Técnicas de programação I

## Análise exploratória de dados/Pandas

Nomes:

Turma:

Nesse projeto trabalharemos com dados fictícios de investidores.

São 3 arquivos que devem ser carregados para responder as perguntas abaixo.

Para a entrega, coloque o notebook respondido no seu github (um por grupo)!

Informações

Cadastro:
- **id** : Identificação do investidor
- **Nome** : Nome completo do investidor 
- **Sexo** : Feminino ou masculino
- **Nasc** : Data de nascimento
- **Idade** : Idade do investidor 
- **Email** : E-mail do investidor
- **Lat_long** : Dados geográficos do investidor
- **Job** : Profisão do investidor ou do seu responsável (em inglês)
- **Estado** : Estado onde o investidor reside

Investimento:
- **id** : Identificação do investidor
- **Salario** : Renda do investidor ou seu responsável
- **Perfil** : Perfil de investimento
- **Ativo01, Ativo02, Ativo03, Ativo04, Ativo05, Ativo06, Ativo07** : O quanto de dinheiro o investidor colocou em cada ativo
- **Nota1, Nota2** : O quanto o investidor está satisfeito com nossa empresa (2 avaliações)

Lembrando que esses dados são irreais e fictícios

Arquivo cadastro.csv


Arquivo investimento.csv (dividido em 2 partes)

### Critérios de avaliação

Os seguintes itens serão avaliados:

1. Reprodutibilidade do código: seu código será executado e precisa gerar os mesmos resultados apresentados por você;

2. Clareza: seu código precisa ser claro e deve existir uma linha de raciocínio direta. Comente o código em pontos que julgar necessário para o entendimento total;

3. Explicação de todos os processos feitos e decisões tomadas

## Informações Gerais sobre o Projeto

- O projeto poderá ser desenvolvido __individualmente__ ou em __grupos com até 4 pessoas__, caos façam em grupos enviar a relação de alunos do grupo para o professor;


- Data de Entrega: 14/04/2023;

- Entrega: Através do _Class_

## 1 - Carregar os arquivos e cadastro, investimento1 e investimento2 e mostrar a quantidade de linhas de cada um, além das informações desses dataframes

In [1]:
# Pacotes gerados pelos alunos para testar os pacotes e carregar os arquivos: 

import Module
from Module import inv1, inv2, cadastro

# Pacotes recomendados pelo professor: 

import pandas as pd
import datetime as dt

Sucesso ao importar o pacote pandas.
Sucesso ao importar o pacote numpy.
Sucesso ao importar o pacote os.
Sucesso ao importar o pacote sys.
Sucesso ao importar o pacote matplotlib.pyplot.
Sucesso ao importar o pacote seaborn.
Sucesso ao importar o pacote statsmodels.
Sucesso ao importar o pacote scipy.
Sucesso ao importar o pacote pypfopt.
Sucesso ao importar o pacote functools.
Sucesso ao importar pandas as pd.
Sucesso ao importar numpy as np.
Sucesso ao importar os as os.
Sucesso ao importar sys as sys.
Sucesso ao importar matplotlib.pyplot as plt.
Sucesso ao importar seaborn as sns.
Sucesso ao importar statsmodels as sm.
Sucesso ao importar scipy.linalg as ln.
Sucesso ao importar pypfopt as pypfopt.
Sucesso ao importar functools as functools.

In [2]:
# Separador de texto: 

div = 50 * '-'

# Planilha de união de inv1 e inv2: 
merged = inv1.merge(inv2, on = list(inv1.columns), how = 'outer')


print(div,
      'Planilha: cadastro: ',
      f'len: {len(cadastro)}',
      f'Columns : {list(cadastro.columns)}',
      div,
      'Planilha: inv1: ',
      f'len: {len(inv1)}',
      f'Columns : {list(inv1.columns)}',
      div,
      'Planilha: inv2: ',
      f'len: {len(inv2)}',
      f'Columns : {list(inv2.columns)}',
      div,
      'Merged: ',
      f"len: {len(merged)}",
      f"Columns: {list(merged.columns)}",
      sep = '\n'
      )

--------------------------------------------------
Planilha: cadastro:
len: 38754
Columns : ['id', 'Nome', 'Sexo', 'Nasc', 'Idade', 'Email', 'Lat_long', 'Job', 'Estado']
--------------------------------------------------
Planilha: inv1:
len: 20000
Columns : ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']
--------------------------------------------------
Planilha: inv2:
len: 24052
Columns : ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']
--------------------------------------------------
Merged:
len: 38754
Columns: ['id', 'Salario', 'Perfil', 'Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07', 'Nota1', 'Nota2']

## 2 - Juntar os dataframes de investimento1 e investimento2 em um só e ver a quantidade de linhas

In [3]:
# Método para unir os dois dataframse: 

merged = pd.merge( # Funcao merge do dataframe. Neste caso, "how = 'outer'" é equivalente a usar pandas.concat() e .drop_duplicates()
    inv1, inv2, # dfs que serão unidos;
    on = list(inv1.columns), # Tabelas que serão consideradas para a união;
    how = 'outer') # Método de união. 'outer' significa que as linhas são unidas. Neste caso, há a concatenação e remoção dos duplicados.

# Para comparação:

# pd.concat(
#     [inv1, inv2]
# ).drop_duplicates()

## 3 - Crie um novo dataframe eliminando as linhas duplicadas

In [4]:
# O método merge how = 'outer' já elimina as linhas duplicadas. Para o caso de pd.concat, fica:

pd.concat(
    [inv1, inv2],
).drop_duplicates()

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601
...,...,...,...,...,...,...,...,...,...,...,...,...
24046,id0012328,$86268.66,Moderado,804.92,4520.13,3388.55,18396.16,NaN,NaN,504.90,97.685833,70.195608
24048,id0005515,$212.76,Conservador,1624.80,NaN,2689.68,21886.01,4571.79,NaN,497.47,93.032164,93.621515
24049,id0009893,$9.32,Agressivo,829.20,NaN,3831.45,NaN,4784.34,2143.79,485.33,3.120521,9.086454
24050,id0016100,$81796.74,Conservador,1587.47,4881.66,4352.03,10391.18,4695.44,2465.65,492.84,95.665966,30.164927
24051,id0027880,$38480.37,Agressivo,996.90,5604.43,2801.04,9183.62,6220.96,NaN,503.24,55.035639,57.691996

## 4 - Junte o dataframe de investimento com o de cadastro
Dica: use a chave id

In [5]:
# Repete-se o método anterior, com as tabelas cadastro e merged.

total = cadastro.merge(merged, on = 'id')
total

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38749,id0038750,Beatriz Maísa de Miranda Milani,Fem,1999-02-20,22,mark47@gmail.com,"(Decimal('-23.8494875'), Decimal('-91.561304'))",Further education lecturer,RS,$4993.49,Moderado,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76,66.644257,6.462871
38750,id0038751,Juan dos Santos,Masc,1999-07-10,22,greggnguyen@hotmail.com,"(Decimal('-7.8876355'), Decimal('155.835880'))",Adult guidance worker,PI,$41218.63,Moderado,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02,96.987294,72.333030
38751,id0038752,Severino Edson de Viana Loase,Masc,1981-12-01,40,cindy11@yahoo.com,"(Decimal('-52.1338005'), Decimal('-59.715325'))",Arts development officer,PR,$32.41,Agressivo,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32,32.139610,22.742974
38752,id0038753,Kim Mooshi,Masc,1999-12-06,22,mcdonaldmario@gmail.com,"(Decimal('-81.2874995'), Decimal('-28.805800'))",Production manager,RJ,$914.52,Conservador,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65,98.385080,56.611838
38753,id0038754,Vinícius Arnaldo de Pereira Mendes,Masc,2003-09-13,18,omartinez@hotmail.com,"(Decimal('-37.248521'), Decimal('6.033254'))",Pension scheme manager,AL,$29076.19,Moderado,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95,29.660050,47.371606

## 5 - Ordene o dataframe pelo id, de forma crescente e redefina o índice

In [6]:
# O método sort_values organiza os dados por alguma ordem e coluna, a depender da escola do usuário.

total.sort_values(by = 'id', ascending = True)

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38749,id0038750,Beatriz Maísa de Miranda Milani,Fem,1999-02-20,22,mark47@gmail.com,"(Decimal('-23.8494875'), Decimal('-91.561304'))",Further education lecturer,RS,$4993.49,Moderado,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76,66.644257,6.462871
38750,id0038751,Juan dos Santos,Masc,1999-07-10,22,greggnguyen@hotmail.com,"(Decimal('-7.8876355'), Decimal('155.835880'))",Adult guidance worker,PI,$41218.63,Moderado,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02,96.987294,72.333030
38751,id0038752,Severino Edson de Viana Loase,Masc,1981-12-01,40,cindy11@yahoo.com,"(Decimal('-52.1338005'), Decimal('-59.715325'))",Arts development officer,PR,$32.41,Agressivo,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32,32.139610,22.742974
38752,id0038753,Kim Mooshi,Masc,1999-12-06,22,mcdonaldmario@gmail.com,"(Decimal('-81.2874995'), Decimal('-28.805800'))",Production manager,RJ,$914.52,Conservador,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65,98.385080,56.611838
38753,id0038754,Vinícius Arnaldo de Pereira Mendes,Masc,2003-09-13,18,omartinez@hotmail.com,"(Decimal('-37.248521'), Decimal('6.033254'))",Pension scheme manager,AL,$29076.19,Moderado,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95,29.660050,47.371606

## 6 - Faça uma análise dos dados faltantes e trate-os

Mostre todas as colunas com dados faltantes, sua quantidade/porcentagem e como tratar (preencher) cada uma delas explicando sua estratégia

In [23]:
# Primeiro, descobrimos o tamanho da tabela:

size = len(total)

# Print: 

print(div, 
      'Total de faltas: ', 
      div, 
      sep = '\n')

# Print de cada coluna: 

for i in total:
      # Calculamos o total de ocorrências usando o método .dropna:
      occur = len(total[i]) - len(total[i].dropna())
      percent = str(100*occur/size)[:5] + ' %' # Caso queira exibir o número: percent = occur/size
      print(f'{i}: {occur}, % = {percent}')

--------------------------------------------------
Total de faltas:
--------------------------------------------------
id: 0, % = 0.0 %
Nome: 0, % = 0.0 %
Sexo: 0, % = 0.0 %
Nasc: 0, % = 0.0 %
Idade: 0, % = 0.0 %
Email: 0, % = 0.0 %
Lat_long: 0, % = 0.0 %
Job: 0, % = 0.0 %
Estado: 0, % = 0.0 %
Salario: 0, % = 0.0 %
Perfil: 0, % = 0.0 %
Ativo01: 9724, % = 25.09 %
Ativo02: 6100, % = 15.74 %
Ativo03: 6169, % = 15.91 %
Ativo04: 11887, % = 30.67 %
Ativo05: 6191, % = 15.97 %
Ativo06: 19514, % = 50.35 %
Ativo07: 0, % = 0.0 %
Nota1: 3000, % = 7.741 %
Nota2: 2000, % = 5.160 %

In [38]:
# O ativo 7 tem 100% de participação, logo todo investidor investiu em pelo menos um ativo. Investigamos agora se algum investidor não deu nota:

size = len(total[['Nota1', 'Nota2']]) # Separamos as colunas com notas
size_rem = len(total[['Nota1', 'Nota2']].dropna(how = 'all')) # Retiramos as colunas que não possuem nenhuma nota (método "how = 'all'")

occur = size - size_rem
percent = str((100*occur)/size)
# Total de investidores que não deu nenhuma nota: 

print(div,
      'Total de investidores que não deram nenhuma avaliação: ',
      div,
      sep = '\n')
print('Número:', occur)
print('%:', percent[:5] + '%')

--------------------------------------------------
Total de investidores que não deram nenhuma avaliação:
--------------------------------------------------
Número: 165
%: 0.425%

###  Considerações sobre dados faltantes:

In [42]:
# Separando os dados com faltas:

# Colunas com ativos
ativos_col = [
    'id',
    'Ativo01',
    'Ativo02',
    'Ativo03',
    'Ativo04',
    'Ativo05',
    'Ativo06',
    'Ativo07'
]

# Colunas com notas
notas_col = ['id', 'Nota1', 'Nota2']

# dataframes:

df_ativos = total[ativos_col]
df_notas = total[notas_col]

### Ativos com nan:

Ativos totais

In [43]:
df_ativos

,id,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07
0,id0000001,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72
1,id0000002,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17
2,id0000003,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12
3,id0000004,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05
4,id0000005,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98
...,...,...,...,...,...,...,...,...
38749,id0038750,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76
38750,id0038751,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02
38751,id0038752,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32
38752,id0038753,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65
38753,id0038754,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95

Ativos separados

In [53]:
df_ativos_nan = df_ativos[df_ativos.isna().any(axis = 1)]
df_ativos_nan

,id,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07
0,id0000001,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72
1,id0000002,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17
2,id0000003,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12
3,id0000004,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05
5,id0000006,858.43,5628.75,NaN,13431.14,4409.81,NaN,492.03
...,...,...,...,...,...,...,...,...
38748,id0038749,988.55,4744.25,NaN,17341.08,4866.52,2049.56,498.69
38749,id0038750,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76
38751,id0038752,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32
38752,id0038753,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65
38753,id0038754,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95

Notas com nan

In [54]:
df_notas_nan = df_notas[df_notas.isna().any(axis = 1)]
df_notas_nan

              id      Nota1      Nota2
18     id0000019        NaN  62.656956
20     id0000021        NaN  45.971684
21     id0000022        NaN  85.798564
24     id0000025        NaN  70.575475
28     id0000029        NaN   6.661650
...          ...        ...        ...
38687  id0038688        NaN   9.589640
38700  id0038701        NaN  88.598436
38739  id0038740        NaN  57.935261
38741  id0038742  93.844274        NaN
38744  id0038745  24.872004        NaN

[4835 rows x 3 columns]

Notas com 2 nans

In [59]:
df_notas_nan[df_notas_nan[['Nota1', 'Nota2']].isna().all(axis=1)]

              id  Nota1  Nota2
59     id0000060    NaN    NaN
123    id0000124    NaN    NaN
267    id0000268    NaN    NaN
272    id0000273    NaN    NaN
638    id0000639    NaN    NaN
...          ...    ...    ...
37572  id0037573    NaN    NaN
37797  id0037798    NaN    NaN
37919  id0037920    NaN    NaN
38212  id0038213    NaN    NaN
38395  id0038396    NaN    NaN

[165 rows x 3 columns]

## 7 - Manipule os dados a seguir:
- Criar coluna "Total" somando o valor de todos os ativos por investidor
- Criar coluna "Media" com a média das notas 1 e 2
- Criar coluna "Dominio" com apenas o domínio do email (dica: separar por @)
- Mudar o nome da coluna "Salário" para "Renda" e tratar a coluna (sem caracter $ e tipo numérica)
- Mudar os dados da coluna "Sexo" para Masculino e Feminino (tente usar o map)
- Transformar os dados da coluna Media em inteiro
- Criar coluna "NPS" onde o investidor é promotor se a média das notas é maior igual a 80, neutro se a média estiver entre 50 e 80, e detrator se for abaixo de 50

## 8 - Calcule os seguintes dados
- Calcule o total investido em cada coluna Ativo (tente usar o apply)
- Qual o menor valor investido em cada ativo?
- Mostre a média e desvio padrão de cada ativo
- Qual a idade do investidor mais velho?
- Qual a mediana da coluna Média?

## 9 - Responder as perguntas abaixo

- Quantos investidores são promotores?
- Quantos investidores são do sexo feminino?
- Quantos investidores investiram mais de 16000 no Ativo04?
- Quantos investidores investiram mais de 16000 no Ativo04 e menos de 5000 no Ativo05?
- Quantos investidores do sexo feminino tem mais de 25 anos e investiu menos de 10000? (bonus: por que esse dado seria importante para a estratégia da nossa empresa?

- Quantos investidores tem em cada estado (dica: use groupby)
- Qual é a soma do total investido por cada estado?
- Como os investidores se distribuem em promotores, detratores e neutros?
- Qual é a média do total investido por promotores, detratores e neutros?